In [47]:
import pandas as pd
import pyodbc
import sqlite3
from datetime import datetime

# iedereen heeft andere servername btw

In [48]:
servername = 'SIU1\\SQLEXPRESS'

# Northwind connectie

In [49]:
northwind_conn = pyodbc.connect('DRIVER={SQL SERVER};SERVER='+servername+';DATABASE=NorthWind; Trusted_Connection=yes')
nwCursor = northwind_conn.cursor()
nwCursor

# Adventureworks connectie

In [50]:
adventureworks_conn = pyodbc.connect('DRIVER={SQL SERVER};SERVER='+servername+';DATABASE=AdventureWorks2019; Trusted_Connection=yes')
awCursor = adventureworks_conn.cursor()
awCursor

# Aenc connectie

In [51]:
aenc_conn = pyodbc.connect('DRIVER={Microsoft Access Driver (*.mdb, *.accdb)};DBQ=../raw-databases/aenc.accdb;')
aencCursor = aenc_conn.cursor()

table_names = [table_info.table_name for table_info in aencCursor.tables()]

# Print table names
print(table_names)

['MSysAccessStorage', 'MSysACEs', 'MSysComplexColumns', 'MSysIMEXColumns', 'MSysIMEXSpecs', 'MSysNameMap', 'MSysNavPaneGroupCategories', 'MSysNavPaneGroups', 'MSysNavPaneGroupToObjects', 'MSysNavPaneObjectIDs', 'MSysObjects', 'MSysQueries', 'MSysRelationships', 'MSysResources', 'bonus', 'customer', 'department', 'employee', 'product', 'region', 'sales_order', 'sales_order_item', 'state']

In [52]:
aenctest = pd.read_sql_query('SELECT * FROM customer', aenc_conn)
awtest = pd.read_sql_query('SELECT * FROM Person.Address', adventureworks_conn)
nwtest = pd.read_sql_query('SELECT * FROM customers', northwind_conn)

# print(aenctest)
# print(awtest)
# print(nwtest)

C:\Users\tinep\AppData\Local\Temp\ipykernel_19956\825424140.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenctest = pd.read_sql_query('SELECT * FROM customer', aenc_conn)
C:\Users\tinep\AppData\Local\Temp\ipykernel_19956\825424140.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  awtest = pd.read_sql_query('SELECT * FROM Person.Address', adventureworks_conn)
C:\Users\tinep\AppData\Local\Temp\ipykernel_19956\825424140.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  nwtest = pd.read_sql_query('SELECT * FROM customers', northwind_conn)

# Dataframe maken

AenC

In [53]:
aenctest1 = pd.read_sql_query('SELECT emp_ID, city, state, start_date, sex, birth_date FROM employee', aenc_conn)
aenctest2 = pd.read_sql_query('SELECT state_id, country FROM state', aenc_conn)
aencmerged_df = pd.merge(aenctest1, aenctest2, left_on= 'state', right_on= 'state_id')
aencmerged_df.drop(columns=['state_id'], inplace=True)
aencmerged_df

C:\Users\tinep\AppData\Local\Temp\ipykernel_19956\45571050.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenctest1 = pd.read_sql_query('SELECT emp_ID, city, state, start_date, sex, birth_date FROM employee', aenc_conn)
C:\Users\tinep\AppData\Local\Temp\ipykernel_19956\45571050.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenctest2 = pd.read_sql_query('SELECT state_id, country FROM state', aenc_conn)

,emp_ID,city,state,start_date,sex,birth_date,country
0,102,Needham,MA,26-Feb-1987 12:00:00 AM,F,05-Jun-1959 12:00:00 AM,USA
1,105,Waltham,MA,02-Jul-1987 12:00:00 AM,M,04-Dec-1961 12:00:00 AM,USA
2,129,Atlanta,GA,04-Aug-1998 12:00:00 AM,M,30-Oct-1967 12:00:00 AM,USA
3,148,Winchester,MA,04-Oct-1997 12:00:00 AM,F,13-Dec-1952 12:00:00 AM,USA
4,160,Milton,MA,16-Dec-1987 12:00:00 AM,M,13-May-1948 12:00:00 AM,USA
...,...,...,...,...,...,...,...
70,1643,Burlington,MA,15-Jun-1997 12:00:00 AM,F,12-Sep-1969 12:00:00 AM,USA
71,1658,Waltham,MA,28-Aug-1997 12:00:00 AM,M,18-Jan-1974 12:00:00 AM,USA
72,1684,Waltham,MA,13-Sep-1997 12:00:00 AM,F,31-Oct-1970 12:00:00 AM,USA
73,1740,Bedford,MA,23-Dec-1997 12:00:00 AM,M,19-Jun-1966 12:00:00 AM,USA
74,1751,Needham,MA,10-Jan-1998 12:00:00 AM,M,12-Dec-1964 12:00:00 AM,USA

AdventureWorks

In [54]:
awtest1 = pd.read_sql_query('SELECT businessEntityID, JobTitle, BirthDate, Gender, HireDate FROM HumanResources.Employee', adventureworks_conn)
awtest2 = pd.read_sql_query('SELECT BusinessEntityID, AddressID FROM Person.BusinessEntityAddress', adventureworks_conn)
awtest3 = pd.read_sql_query('SELECT AddressID, StateProvinceID FROM Person.Address', adventureworks_conn)
awtest4 = pd.read_sql_query('SELECT StateProvinceID, CountryRegionCode FROM Person.StateProvince', adventureworks_conn)
awtest5 = pd.read_sql_query('SELECT CountryRegionCode, Name FROM Person.CountryRegion', adventureworks_conn)

awmerged_df1 = pd.merge(awtest1, awtest2, left_on='businessEntityID', right_on='BusinessEntityID').drop(columns=['BusinessEntityID'])
awmerged_df2 = pd.merge(awmerged_df1, awtest3, on='AddressID')
awmerged_df3 = pd.merge(awmerged_df2, awtest4, on='StateProvinceID')
awmerged_df4 = pd.merge(awmerged_df3, awtest5, on='CountryRegionCode')

awmerged_df4

C:\Users\tinep\AppData\Local\Temp\ipykernel_19956\364707996.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  awtest1 = pd.read_sql_query('SELECT businessEntityID, JobTitle, BirthDate, Gender, HireDate FROM HumanResources.Employee', adventureworks_conn)
C:\Users\tinep\AppData\Local\Temp\ipykernel_19956\364707996.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  awtest2 = pd.read_sql_query('SELECT BusinessEntityID, AddressID FROM Person.BusinessEntityAddress', adventureworks_conn)
C:\Users\tinep\AppData\Local\Temp\ipykernel_19956\364707996.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  awtest3 = pd.read_sql_query('SELECT AddressID, StateProvinceID FROM Person.Address', adventureworks_conn)
C:\Users\tinep\AppData\Local\Temp\ipykernel_19956\364707996.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  awtest4 = pd.read_sql_query('SELECT StateProvinceID, CountryRegionCode FROM Person.StateProvince', adventureworks_conn)
C:\Users\tinep\AppData\Local\Temp\ipykernel_19956\364707996.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  awtest5 = pd.read_sql_query('SELECT CountryRegionCode, Name FROM Person.CountryRegion', adventureworks_conn)

,businessEntityID,JobTitle,BirthDate,Gender,HireDate,AddressID,StateProvinceID,CountryRegionCode,Name
0,1,Chief Executive Officer,1969-01-29,M,2009-01-14,249,79,US,United States
1,2,Vice President of Engineering,1971-08-01,F,2008-01-31,293,79,US,United States
2,3,Engineering Manager,1974-11-12,M,2007-11-11,224,79,US,United States
3,4,Senior Tool Designer,1974-12-23,M,2007-12-05,11387,36,US,United States
4,5,Design Engineer,1952-09-27,F,2008-01-06,190,79,US,United States
...,...,...,...,...,...,...,...,...,...
285,286,Sales Representative,1977-02-14,F,2013-05-30,36,77,AU,Australia
286,287,European Sales Manager,1957-09-20,F,2012-04-16,300,79,US,United States
287,288,Sales Representative,1975-07-09,F,2013-05-30,35,20,DE,Germany
288,289,Sales Representative,1968-03-17,F,2012-05-30,37,14,GB,United Kingdom
289,290,Sales Representative,1975-09-30,M,2012-05-30,34,119,FR,France

NorthWind

In [55]:
nwtest = pd.read_sql_query('SELECT EmployeeID, Title, HireDate, City, Region, Country, BirthDate FROM employees', northwind_conn)
nwtest

C:\Users\tinep\AppData\Local\Temp\ipykernel_19956\3892885385.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  nwtest = pd.read_sql_query('SELECT EmployeeID, Title, HireDate, City, Region, Country, BirthDate FROM employees', northwind_conn)

,EmployeeID,Title,HireDate,City,Region,Country,BirthDate
0,1,Sales Representative,1992-05-01,Seattle,WA,USA,1948-12-08
1,2,"Vice President, Sales",1992-08-14,Tacoma,WA,USA,1952-02-19
2,3,Sales Representative,1992-04-01,Kirkland,WA,USA,1963-08-30
3,4,Sales Representative,1993-05-03,Redmond,WA,USA,1937-09-19
4,5,Sales Manager,1993-10-17,London,None,UK,1955-03-04
5,6,Sales Representative,1993-10-17,London,None,UK,1963-07-02
6,7,Sales Representative,1994-01-02,London,None,UK,1960-05-29
7,8,Inside Sales Coordinator,1994-03-05,Seattle,WA,USA,1958-01-09
8,9,Sales Representative,1994-11-15,London,None,UK,1966-01-27

Samenvoegen

In [56]:
employee = pd.concat([nwtest, awmerged_df4], axis =0)
employee = pd.concat([employee, aencmerged_df], axis =0)

employee['row_id'] = range(len(employee))

employee['employeeid'] = employee.apply(lambda row: str(row['EmployeeID']) if not pd.isnull(row['EmployeeID']) else str(row['businessEntityID']) if not pd.isnull(row['businessEntityID']) else str(row['emp_ID']) if not pd.isnull(row['emp_ID']) else row['id'], axis=1)
employee['title'] = employee['Title'].combine_first(employee['JobTitle'])
employee['gender'] = employee['Gender'].combine_first(employee['sex'])
employee['city'] = employee['City'].combine_first(employee['city'])
employee['region'] = employee['Region']
employee['country'] = employee['Country'].combine_first(employee['country'])
employee['hiredate'] = employee['HireDate'].combine_first(employee['start_date'])
employee['birthdate'] = employee['BirthDate'].combine_first(employee['birth_date'])

final_columns = [
    'employeeid', 'title', 'gender', 'city', 'region', 'country', 
    'hiredate', 'birthdate', 'row_id'
]

final_employee_df = employee[final_columns]

employee = final_employee_df

employee

,employeeid,title,gender,city,region,country,hiredate,birthdate,row_id
0,1.0,Sales Representative,NaN,Seattle,WA,USA,1992-05-01 00:00:00,1948-12-08 00:00:00,0
1,2.0,"Vice President, Sales",NaN,Tacoma,WA,USA,1992-08-14 00:00:00,1952-02-19 00:00:00,1
2,3.0,Sales Representative,NaN,Kirkland,WA,USA,1992-04-01 00:00:00,1963-08-30 00:00:00,2
3,4.0,Sales Representative,NaN,Redmond,WA,USA,1993-05-03 00:00:00,1937-09-19 00:00:00,3
4,5.0,Sales Manager,NaN,London,None,UK,1993-10-17 00:00:00,1955-03-04 00:00:00,4
...,...,...,...,...,...,...,...,...,...
70,1643,NaN,F,Burlington,NaN,USA,15-Jun-1997 12:00:00 AM,12-Sep-1969 12:00:00 AM,369
71,1658,NaN,M,Waltham,NaN,USA,28-Aug-1997 12:00:00 AM,18-Jan-1974 12:00:00 AM,370
72,1684,NaN,F,Waltham,NaN,USA,13-Sep-1997 12:00:00 AM,31-Oct-1970 12:00:00 AM,371
73,1740,NaN,M,Bedford,NaN,USA,23-Dec-1997 12:00:00 AM,19-Jun-1966 12:00:00 AM,372
74,1751,NaN,M,Needham,NaN,USA,10-Jan-1998 12:00:00 AM,12-Dec-1964 12:00:00 AM,373

In [ ]:
employee.dtypes
#test

# DATABASE

In [58]:
united_conn = pyodbc.connect('DRIVER={SQL SERVER};SERVER='+servername+';DATABASE=UnitedOutdoors; Trusted_Connection=yes')
unitedCursor = united_conn.cursor()
unitedCursor

In [59]:
# Convert all date columns to a uniform datetime format
employee['hiredate'] = pd.to_datetime(employee['hiredate'])
employee['birthdate'] = pd.to_datetime(employee['birthdate'])

# Specify the desired format
date_format = '%d-%m-%Y'

# Apply the format to the datetime columns
employee['hiredate'] = employee['hiredate'].dt.strftime(date_format)
employee['birthdate'] = employee['birthdate'].dt.strftime(date_format)

# Resultaat bekijke
print(employee.head())

  employeeid                  title gender      city region country  \
0        1.0   Sales Representative    NaN   Seattle     WA     USA
1        2.0  Vice President, Sales    NaN    Tacoma     WA     USA
2        3.0   Sales Representative    NaN  Kirkland     WA     USA
3        4.0   Sales Representative    NaN   Redmond     WA     USA
4        5.0          Sales Manager    NaN    London   None      UK

     hiredate   birthdate  row_id
0  01-05-1992  08-12-1948       0
1  14-08-1992  19-02-1952       1
2  01-04-1992  30-08-1963       2
3  03-05-1993  19-09-1937       3
4  17-10-1993  04-03-1955       4

In [60]:
#datum converten van dd-mm-yyyy naar yyyy-mm-dd
def convert_date(date_str):
    # Converteer string naar datetime object
    date_object = datetime.strptime(date_str, '%d-%m-%Y')
    # Formateer de datum naar yyyy-mm-dd formaat
    formatted_date = date_object.strftime('%Y-%m-%d')
    return formatted_date

#toepassen op de dataframe
employee['hiredate'] = employee['hiredate'].apply(convert_date)
employee['birthdate'] = employee['birthdate'].apply(convert_date)

In [61]:
employee = employee.replace({'': None})
for index, row in employee.iterrows():
    try:
        query = """INSERT INTO employee (
            employee_employeeid,
            employee_title, 
            employee_gender, 
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)"""  
        
        values = (
            row['employeeid'] if pd.notnull(row['employeeid']) else '',
            row['title'] if pd.notnull(row['title']) else '',
            row['gender'] if pd.notnull(row['gender']) else '',
            row['city'] if pd.notnull(row['city']) else '',
            row['region'] if pd.notnull(row['region']) else '',
            row['country'] if pd.notnull(row['country']) else '',
            row['hiredate'] if pd.notnull(row['hiredate']) else '',
            row['birthdate'] if pd.notnull(row['birthdate']) else ''
        )

        unitedCursor.execute(query, values)

    except pyodbc.IntegrityError as e:
        continue
    except pyodbc.Error as e:
        print("Er is een fout opgetreden: ", e)
        print("Foutieve query: ", query)
    
unitedCursor.commit()

print("Data is succesvol geïmporteerd in de UnitedOutdoors database")

Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '1.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '2.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '3.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '4.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '5.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '6.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '7.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '8.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '9.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '1.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '2.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '3.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '4.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '5.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '6.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '7.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '8.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '9.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '10.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '11.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '12.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '13.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '14.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '15.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '16.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '17.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '18.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '19.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '20.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '21.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '22.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '23.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '24.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '25.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '26.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '27.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '28.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '29.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,
            employee_region,
            employee_country,
            employee_hiredate,
            employee_birthdate
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
Er is een fout opgetreden:  ('22018', "[22018] [Microsoft][ODBC SQL Server Driver][SQL Server]Conversion failed when converting the nvarchar value '30.0' to data type int. (245) (SQLExecDirectW)")
Foutieve query:  INSERT INTO employee (
            employee_employeeid,
            employee_title,
            employee_gender,
            employee_city,